[{
	"title":"Boiled Fresh Octopus",
	"ingredients":["1 Octopus, very fresh","soy sauce","wasabi"],
	"website":"http://www.thehongkongcookery.com/2015/01/boiled-fresh-octopus.html",
	"tools":["sashimi knife","large pot"],
	"image":"https://farm8.staticflickr.com/7468/16025207280_bedbf0e1b4.jpg",
	"directions":[
		{"text":"Separate the head from the tentacles if your fish guy hasn't done it yet.  Remove the eyes, teeth, cartilage spine and whatever else that is in the octopus head.  Rinse your octopus in running water for a minute.  DO NOT cut up the octopus now.  Cook first and slice it up later."},
	{"text":"In a large pot, heat enough water to cover the octopus by an inch or so.  When the water boils add the octopus.  When the water reboils, cover and cook 5-15 minutes according to your preference. Remove from water immediately and let cool completely. Slice tentacles at an angle into 1/4 inch thick slices and the head meat into neat strips with a good sharp sashimi knife (if you have one.)"},
	{"text":"Arrange nicely on plate and serve with a dip of your best soy sauce with a dash of wasabi!"}
	]
},{
	"title":"Spicy Chilli Garlic Octopus",
	"website":"https://dentistvschef.wordpress.com/2013/07/28/how-to-cook-octopus-spicy-octopus-with-chilli-and-garlic-recipe/",
	"image":"https://dentistvschef.files.wordpress.com/2013/07/octopus-chilli-garlic-spicy-recipe.jpg",
	"ingredients":["250 gr octopus",
		"6 garlic, finelly chopped",
		"6 red chillies/ cayenne pepper, fenely chopped",
		"3 bird eye chillies or more for hotter taste, finely chopped",
		"tomato ketchup",
		"oyster sauce",
		"1 cm ginger, finely chopped",
		"1 tsp lime juice",
		"salt and pepper to taste",
		"a pinch of sugar",
		"1 cup of water",
		"2 tbsp of olive oil"],
	"tools":["skillet","knife",],
	"directions":[{"text":"Heat up the oil in a heavy bottom sauteuse pan or skillet, saute the garlic and ginger until fragrant"},
		{"text":"Add the octopus and saute another 2 minutes until the liquid dripped out from the octopus is totally evaporated"},
		{"text":"Add all the chillies and saute for about 3 minutes"},
		{"text":"Add the water and bring to boil, season with lime juice, tomato ketchup,oyster sauce, salt, pepper and sugar, bring it to boil"},
		{"text":"Reduce and simmer for about 30 minutes or until the octopus got tender and the chilli garlic sauce is thicken"}	]
},{
	"title":"Stuffed Baby Octopus with XO Sauce",
	"website":"https://asianinspirations.com.au/recipe/stuffed-baby-octopus-with-xo-sauce",
	"image":"https://asianinspirations.com.au/wp-content/uploads/2014/10/ROD-Wednesday-Stuffed-Baby-Octopus-with-XO-Sauce-1024x682.jpg",
	"ingredients":["1 red capsicum (sliced)","350g baby octopus","2 tbsp vegetable oil","5 tbsp Lee Kum Kee XO Sauce","½ tbsp Lee Kum Kee Oyster Sauce"],
	"directions":[
		{"text":"Stuff baby octopus with filling."},
		{"text":"Pan-fry baby octopus in oil until golden or cooked. Arrange on a serving plate."},
		{"text":"Use remaining oil to stir-fry capsicum for 1 min. Serve with octopus."}	],
	"tools":["frying pan"],
},{
	"title":"Spicy Stir Fried Octopus w/ Vegetables",
	"website":"https://recipes.sparkpeople.com/recipe-detail.asp?recipe=416130",
	"image":"https://sparkpeo.hs.llnwd.net/e1/resize/630m620/e4/nw/8/4/l848331050.jpg",
	"ingredients":[
		"1 lb octopus",
		"1 cup onion, diced",
		"2 chilies or jalapenos, sliced on the bias",
		"2 green onions, sliced on the bias",
		"1 cup zucchini strips ",
		"1/2 cup carrots thin strips",
		"1 red or green peppers, sliced in long strips",
		"For sauce :",
		"1 cup mushrooms, quartered (optional)",
		"1 tbsp kochujang (chili paste)",
		"2 tbsp chili powder",
		"1 tbsp soy sauce",
		"2 tbsp sesame oil",
		"1 tbsp sesame seeds",
		"2 tbsp minced garlic"
	],
	"directions":[
		{"text":"Wash and rinse octopus, cut the legs into 2-3 inches lengths, open head and take out inside, quarter the head. Drain well."},
		{"text":"Prepare and mix all ingredients for sauce"},
		{"text":"Combine final sauce with octopus and marinate for 10 minutes."},
		{"text":"Heat pan on a medium high heat, cook for 8-10 minutes or until done."}],
	"tools":["frying pan","bowl","knife"],
},{
	"title":"Nakji Bokkeum (Spicy Octopus Stirfry)",
	"website":"http://www.pbs.org/food/recipes/nakji-bokkeum-spicy-octopus-stirfry/",
	"image":"https://www-tc.pbs.org/food/wp-content/blogs.dir/2/files/2013/03/nakji-bokkeum640x360-288x162.jpg",
	"ingredients":[
		"6 pieces of baby octopus",
		"1 ½ cups shredded carrots",
		"½ red pepper",
		"½ green pepper",
		"½ brown onion",
		"3 tbsp gochugaru chilli flakes",
		"2 tbsp minced garlic",
		"1 tbsp minced ginger",
		"2 tbsp white cooking wine",
		"2 tbsp light soy sauce",
		"1 tbsp sesame oil",
		"cooking oil",
		"corn flour",
		"toasted sesame seeds"],
	"directions":[
		{"text":"In a bowl, combine all the ingredients, stir well with a spoon and set it aside."},
		{"text":"Cut up the octopus in smaller pieces."},
		{"text":"Chop up the red and green peppers and half a brown onion"},
		{"text":"In a pot, boil some water and add a teaspoon of vinegar and salt."},
		{"text":"When it starts boiling, add the octopus, cook for about 2 minutes and then move them into a bowl."},
		{"text":"Pour half the sauce over the octopus and give it a light toss"},
		{"text":"Heat up a skillet or wok, drizzle a tablespoon of olive oil and the remaining sauce."},
		{"text":"Add the chopped up onion and let it sweat for about a minute in medium high heat."},
		{"text":"Add the octopus and Give it a good stir for a couple of minutes."},
		{"text":"Lastly, add the chopped green onions, red and green peppers."},
		{"text":"Mix a tablespoon of corn flour with two tablespoons of water and drizzle it over the stirfry."},
		{"text":"Garnish with some toasted sesame seeds"}
	],
	"tools":["bowl","knife","skillet or wok","pot"],
},{
	"title":"Chargrilled octopus with Asian slaw",
	"website":"https://www.sbs.com.au/food/recipes/chargrilled-octopus-asian-slaw",
	"image":"https://www.sbs.com.au/food/sites/sbs.com.au.food/files/styles/full/public/gfa_ep01_chargrilled_octopus_with_asian_slaw_.jpg?itok=nrLhF0NU&mtime=1471267923",
	"ingredients":[
		"1 kg octopus,(tenderised)",
		"80 ml (⅓ cup) extra-virgin olive oil","2 tbsp lime juice",
		"salt and freshly ground black pepper, to taste",
		"Asian slaw:",
		"½ small Chinese cabbage (wombok), finely shredded",
		"2 Lebanese cucumbers, sliced ",
		"2 carrots, finely sliced",
		"good handful coriander leaves, washed",
		"1 long red chilli, finely sliced",
		"1 long green chilli, finely sliced",
		"1 tbsp lime juice",
		"1 tsp sugar",
		"1-2 tbsp fish sauce"
	],
	"directions":[
		{"text":"Cut the octopus into 4-5 cm long strips.  "},
		{"text":"Place the olive oil, lime juice, salt and pepper in a bowl,"},
		{"text":"Add the octopus and marinate for at least 30 minutes or cover and refrigerate for up to 1 day. "},
		{"text":"To make the Asian slaw, combine the cabbage, cucumber, carrot, coriander and chilli in a large bowl.  "},
		{"text":"Whisk together the lime juice and sugar until dissolved, then add just enough fish sauce to make it slightly salty and interesting."},
		{"text":"Pour the dressing over the slaw just before serving and toss to combine well."},
		{"text":"When ready to eat, preheat a chargrill or barbecue hot plate to high. "},
		{"text":"Grill the octopus until golden on all sides. Remember that it is already cooked, so you just want to colour the meat."},
		{"text":" Serve with the slaw and a glass of beer"},
	],
	"tools":["knife","bowls","grill"],
},{
	"title":"Chilli baby octopus stir-fry with broccolini",
	"website":"https://www.taste.com.au/recipes/chilli-baby-octopus-stir-fry-broccolini/3d81a289-958d-44d5-ac7b-59d022d5e388",
	"image":"https://img.taste.com.au/l8AwIfOZ/w720-h480-cfill-q80/taste/2016/11/chilli-baby-octopus-stir-fry-with-broccolini-36041-1.jpeg",
	"ingredients":[
		"500g whole cleaned baby octopus",
		"1 tbsp peanut oil",
		"3 garlic cloves, crushed",
		"2 long fresh red chillies, finely chopped",
		"1 tablespoon finely grated fresh ginger",
		"2 bunches broccolini, cut into florets",
		"80ml (1/3 cup) tomato sauce",
		"2 tablespoons sweet chilli sauce",
		"1 tablespoon brown sugar",
		"Steamed white rice, to serve"
	],
	"directions":[
		{"text":"Use a small sharp knife to cut the baby octopus heads from the tentacles, just below eyes. Cut eyes from the heads and discard. Cut the tentacles in half."},
		{"text":"Heat the oil in a wok or large frying pan over high heat. Add half the octopus and stir-fry for 2-3 minutes or until just cooked. Transfer to a plate. Repeat with the remaining octopus, reheating the pan between batches."},
		{"text":"Add the garlic, chilli and ginger and stir-fry for 1 minute or until aromatic. Add the broccolini and stir-fry for 2 minutes or until just tender. Add the tomato sauce,sweet chilli sauce and sugar and stir-fry for 2-3 minutes or until the sauce boils and thickens. Add the octopus and stir-fry for 1 minute or until heated through."},
		{"text":"Spoon the rice among serving bowls. Top with the octopus stir-fry and serve immediately."},
		
	],
	"tools":["knife","bowls","frying pan"],
},{
	"title":"Deep Fried Salt and Pepper Octopus Tentacles Recipe ",
	"website":"https://cookingwithalison.com/2011/09/21/deep-fried-octopus-tentacles/",
	"image":"https://cookingwithali.files.wordpress.com/2011/09/img_5114.jpg?w=600&h=450",
	"ingredients":[
		"tentacles of octopus",
		"1-2 cups of potato starch",
		"2 small red chili peppers, cut into small pieces with seeds discarded",
		"2 cloves of garlic, finely minced",
		"1 stalk green onion, sliced thinly",
		"ground white pepper",
		"ground black pepper",
		"coarse salt",
		"vegetable oil",
		"optional for garnish:  curly parsley"],
	"directions":[
		{"text":"Separate the tentacles so that you have bunches of three or four tentacles stuck together.  "},
		{"text":"Then cut open the squid body by making a vertical cut through one side of it.  "},
		{"text":"Open up the body, lay it flat, and make shallow diagonal cuts across the inside of the body in a criss cross or diamond pattern."},
		{"text":"Then cut the body into a few, even sized, rectangular shaped pieces, approximately 2″ x 1″. "},
		{"text":"Pour vegetable oil, at least 3 inches deep, into a wok.  "},
		{"text":" Heat this over medium heat until the temperature of the oil reaches 375 F. "},
		{"text":"While you’re waiting for the oil to heat up, place the potato starch in a shallow bowl and stir in a pinch of salt.  "},
		{"text":"Mix together the salt, white pepper and black pepper in a small bowl and set aside."},
		{"text":"Working with one or two pieces of squid at a time, coat them well with the potato starch and gently shake off the excess."},
		{"text":"Place the coated pieces on a plate in a single layer and set aside.  "},
		{"text":"Repeat until all of your squid pieces and tentacles are well coated in potato starch. "},
		{"text":"Cook the squid body pieces and the tentacles separately as they will require different cooking times."},
		{"text":"Do not overcrowd the oil, so you may need to deep fry in two or three batches.  "},
		{"text":"Be sure to bring the temperature back up to 375 F between batches. "},
		{"text":"When the oil is hot enough, gently place your squid into the hot oil and deep fry until the pieces curl, turn golden brown, are cooked through, and are nice and crispy.  "},
		{"text":"This will take around 4 minutes. "},
		{"text":"Don’t overcook the squid.  Use a Chinese wire strainer or a slotted spoon to strain out the squid pieces and transfer them to a paper bag lined plate. "},
		{"text":"Immediately sprinkle over a pinch of the salt and pepper mixture. "},
		{"text":"Repeat with the remaining squid and tentacles.  "},
		{"text":"When all of your squid pieces and tentacles are deep fried, immediately toss the garlic into the hot oil to flash fry it.  "},
		{"text":"Strain out the garlic pieces when they are browned and crispy; this will only take a few seconds. "},
		{"text":"Then immediately toss the squid into a heat proof bowl along with the red chili pepper, deep fried garlic, green onions, and the rest of the salt and pepper mixture.  "},
		{"text":"Toss gently to mix everything together. "},
		{"text":"Dish out and garnish with curly parsley if desired. "},
		{"text":"Serve immediately with white rice."},
	],
	"tools":["wok","knife","bowls"],
}
]